# DemandFlow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..DemandFlow Property
MEPAnalyticalSegment Class See Also
---
The designed flow value, in ft^3/s.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double DemandFlow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DemandFlow As Double
	Get
```

Visual C++
---
```text
public:
property double DemandFlow {
	double get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace